Revit 2027 API
RebarBarType.BarMassPerUnitLength Property
 Defines bar mass per unit length of rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BarMassPerUnitLength { get; set; }
Public Property BarMassPerUnitLength As Double
	Get
	Set
public:
property double BarMassPerUnitLength {
	double get ();
	void set (double value);
}
member BarMassPerUnitLength : float with get, set
Property Value
Double
 The bar mass per unit length of rebar
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for barMassPerUnitLength must be non-negative.
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace